# Parameters
nc: 80 # WILL BE OVERRIDDEN. Number of classes
na: 0
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
seg_ch_num: 2

scales: # model compound scaling constants, i.e. 'model=yolo11n-pose.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 196 layers, 2908507 parameters, 2908491 gradients, 7.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 196 layers, 9948811 parameters, 9948795 gradients, 23.5 GFLOPs
  m: [0.50, 1.00, 512] # summary: 246 layers, 20973273 parameters, 20973257 gradients, 72.3 GFLOPs
  l: [1.00, 1.00, 512] # summary: 372 layers, 26230745 parameters, 26230729 gradients, 91.4 GFLOPs
  x: [1.00, 1.50, 512] # summary: 372 layers, 58889881 parameters, 58889865 gradients, 204.3 GFLOPs

# ResNet50 backbone (torchvision). split=True returns all intermediate feature maps as a list,
# from which the Index modules pull the P3/P4/P5 stages for the FPN neck.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [2048, resnet50, DEFAULT, True, 2, True]] # 0 - resnet50 stem+stages (list output)
  - [0, 1, Index, [512, 6]] # 1 - P3/8   (layer2, 512 ch)
  - [0, 1, Index, [1024, 7]] # 2 - P4/16  (layer3, 1024 ch)
  - [0, 1, Index, [2048, 8]] # 3 - P5/32  (layer4, 2048 ch)
  - [-1, 1, SPPF, [1024, 5]] # 4 - P5/32
  - [-1, 2, C2PSA, [1024]] # 5 - P5/32

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, BoxInst, [nc, na, kpt_shape, seg_ch_num]]
